---
kind: method
id: M:Autodesk.Revit.DB.ExtensibleStorage.ExtensibleStorageFilter.#ctor(System.Guid)
source: html/068a4e61-858f-e6cd-256b-1fee54a8c49a.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.ExtensibleStorageFilter.#ctor Method

Constructs a new instance of a filter to match elements with extensible storage data based on specific Schema id.

## Syntax (C#)
```csharp
public ExtensibleStorageFilter(
	Guid schemaGuid
)
```

## Parameters
- **schemaGuid** (`System.Guid`) - Schema id used to filter elements with extensible storage data